In [1]:
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [2]:
titles = pd.read_csv('titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [3]:
cast = pd.read_csv('cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### Using groupby(), count the number of films that have been released in each decade in the history of cinema.

In [37]:
decades = titles['year'] // 10 * 10
films_by_year = titles.groupby(decades).size()
films_by_year

year
1890        3
1900       37
1910     6512
1920     8797
1930    10097
1940     8576
1950    12711
1960    17515
1970    18714
1980    20243
1990    22225
2000    38713
2010    67977
2020      210
dtype: int64

### Use groupby() count the number of "Hamlet" films made in each decade.

In [38]:
my_filter = titles['title'] == 'Hamlet'
decades = titles[my_filter]['year'] // 10 * 10
films_by_year = titles.groupby(decades).size()
films_by_year

year
1910.0    3
1920.0    1
1940.0    1
1950.0    1
1960.0    2
1970.0    2
1980.0    1
1990.0    2
2000.0    2
2010.0    3
dtype: int64

### How many leading (n=1) roles were available to actors, and how many to actresses, in each year of the 1950s?

In [54]:
my_filter = (cast['n'] == 1) & (cast['year'] >= 1950) & (cast['year'] <= 1959)
cast[my_filter].groupby(['year', 'type']).size()

year  type
1950  actor      626
      actress    281
1951  actor      647
      actress    281
1952  actor      607
      actress    293
1953  actor      652
      actress    301
1954  actor      634
      actress    310
1955  actor      641
      actress    281
1956  actor      643
      actress    305
1957  actor      735
      actress    301
1958  actor      710
      actress    295
1959  actor      721
      actress    317
dtype: int64

### In the 1950s taken as a whole, how many total roles were available to actors, and how many to actresses, for each "n" number 1 through 5?

In [59]:
my_filter = (cast['n'] >= 1) & (cast['n'] <= 5) & (cast['year'] >= 1950) & (cast['year'] <= 1959)

years = cast[my_filter]['year']//10*10

cast[my_filter].groupby([years,'type', 'n']).size()

year  type     n
1950  actor    1.0    6616
               2.0    4564
               3.0    5587
               4.0    5594
               5.0    5611
      actress  1.0    2965
               2.0    4556
               3.0    3148
               4.0    2849
               5.0    2544
dtype: int64

### Use groupby() to determine how many roles are listed for each of the Pink Panther movies.

In [60]:
my_filter = cast['title'].str.contains('Pink Panther', na=False)

cast[my_filter].groupby(['title','type']).size()

title                           type
Curse of the Pink Panther       actor      54
                                actress    13
Revenge of the Pink Panther     actor      49
                                actress    15
Son of the Pink Panther         actor      34
                                actress    12
The Pink Panther                actor      83
                                actress    28
The Pink Panther 2              actor      59
                                actress    25
The Pink Panther Strikes Again  actor      57
                                actress    11
The Return of the Pink Panther  actor      25
                                actress     5
Trail of the Pink Panther       actor      32
                                actress     9
dtype: int64

### List, in order by year, each of the films in which Frank Oz has played more than 1 role.

In [70]:
my_filter = (cast['name'] == 'Frank Oz')

FrankOzMovies = cast[my_filter].groupby(['year','title','type'], as_index=False).size()
my_filter2 = FrankOzMovies['size'] > 1
FrankOzMovies[my_filter2]

    year                                 title   type  size
0   1979                      The Muppet Movie  actor     8
3   1981        An American Werewolf in London  actor     2
4   1981                The Great Muppet Caper  actor     6
5   1982                      The Dark Crystal  actor     2
9   1984            The Muppets Take Manhattan  actor     7
10  1985                      Follow That Bird  actor     3
14  1992            The Muppet Christmas Carol  actor     7
15  1996                Muppet Treasure Island  actor     4
17  1999                    Muppets from Space  actor     4
19  1999  The Adventures of Elmo in Grouchland  actor     3

### List each of the characters that Frank Oz has portrayed at least twice.

In [74]:
my_filter = (cast['name'] == 'Frank Oz')

FrankOzCharacters = cast[my_filter].groupby(['character'], as_index=False).size()
FrankOzCharacters
my_filter2 = FrankOzCharacters['size'] >= 2
FrankOzCharacters[my_filter2]

         character  size
0           Animal     6
2             Bert     3
5   Cookie Monster     3
10     Fozzie Bear     4
15          Grover     2
18      Miss Piggy     6
25   Sam the Eagle     5
34            Yoda     6